require 'openssl'

key = OpenSSL::Random.random_bytes(32) # 32バイトのランダムなキーを生成する
puts(" key-----------------------------------------------------------")
puts(key)
puts("-------------------------------------------------------------")
iv = OpenSSL::Random.random_bytes(16) # 16バイトのランダムな初期化ベクトルを生成する
puts(" iv-----------------------------------------------------------")
puts(iv)
puts("-------------------------------------------------------------")
cipher = OpenSSL::Cipher::Cipher.new('aes256')
puts(" cipher-----------------------------------------------------------")
puts(cipher)
puts("-------------------------------------------------------------")
cipher.encrypt
cipher.key = key
cipher.iv = iv

puts(" instance_variables-----------------------------------------------------------")
puts(cipher.instance_variables())
puts("-------------------------------------------------------------")
